male("Александр 3").
male("Николай 2").
male("Алексей Николаевич").
male("Александр Александрович").
male("Георгий Александрович").
male("Михаил Александрович").
male("Александр 2").
male("Владимир Александрович").
male("Кирилл Владимирович").
male("Андрей Владимирович").
male("Николай 1").
male("Константин Николаевич").
male("Константин Константинович").
male("Олег Константинович").
male("Игорь Константинович").
female("Мария Федоровна").
female("Александра Федоровна").
female("Ольга Николаевна").
female("Татьяна Николаевна").
female("Мария Николаевна").
female("Анастасия Николаевна").
female("Ксения Александровна").
female("Мария Александровна").
female("Александра Александровна").
female("Мария Павловна").
female("Виктория Федоровна").
female("Мария Кирилловна").
female("Кира Кирилловна").
female("Александра Федоровна").
female("Александра Иосифовна").
female("Елизавета Маврикиевна").
female("Вера Константиновна").
child("Николай 2", "Александр 3").
child("Георгий Александрович", "Александр 3").
child("Михаил Александрович", "Александр 3").
child("Ксения Александровна", "Александр 3").
child("Александр Александрович", "Александр 3").
child("Николай 2", "Мария Федоровна").
child("Георгий Александрович", "Мария Федоровна").
child("Михаил Александрович", "Мария Федоровна").
child("Ксения Александровна", "Мария Федоровна").
child("Александр Александрович", "Мария Федоровна").
child("Ольга Николаевна", "Николай 2").
child("Татьяна Николаевна", "Николай 2").
child("Мария Николаевна", "Николай 2").
child("Анастасия Николаевна", "Николай 2").
child("Алексей Николаевич", "Николай 2").
child("Ольга Николаевна", "Александра Федоровна").
child("Татьяна Николаевна", "Александра Федоровна").
child("Мария Николаевна", "Александра Федоровна").
child("Анастасия Николаевна", "Александра Федоровна").
child("Алексей Николаевич", "Александра Федоровна").
child("Владимир Александрович", "Александр 2").
child("Александр 3", "Александр 2").
child("Александра Александровна", "Александр 2").
child("Владимир Александрович", "Мария Александровна").
child("Александр 3", "Мария Александровна").
child("Александра Александровна", "Мария Александровна").
child("Кирилл Владимирович", "Владимир Александрович").
child("Андрей Владимирович", "Владимир Александрович").
child("Кирилл Владимирович", "Мария Павловна").
child("Андрей Владимирович", "Мария Павловна").
child("Мария Кирилловна", "Кирилл Владимирович").
child("Кира Кирилловна", "Кирилл Владимирович").
child("Мария Кирилловна", "Виктория Федоровна").
child("Кира Кирилловна", "Виктория Федоровна").
child("Александр 2", "Николай 1").
child("Константин Николаевич", "Николай 1").
child("Александр 2", "Александра Федоровна").
child("Константин Николаевич", "Александра Федоровна").
child("Константин Константинович", "Константин Николаевич").
child("Константин Константинович", "Александра Иосифовна").
child("Олег Константинович", "Константин Константинович").
child("Игорь Константинович", "Константин Константинович").
child("Вера Константиновна", "Константин Константинович").
child("Олег Константинович", "Елизавета Маврикиевна").
child("Игорь Константинович", "Елизавета Маврикиевна").
child("Вера Константиновна", "Елизавета Маврикиевна").
